# slicing

In [36]:
import numpy as np 
import pandas as pd

In [37]:
data = pd.read_csv('../8_files/kohli_ipl.csv',index_col='match_no')

In [38]:
data

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [39]:
data[6:11]

          runs
match_no
7           34
8            0
9           21
10           3
11          10

In [40]:
data[-5:]

          runs
match_no
211          0
212         20
213         73
214         25
215          7

# fancy indexing

In [41]:
data['runs'][[1,2,3]]

match_no
1     1
2    23
3    13
Name: runs, dtype: int64

In [47]:
data['runs'][1] = 10

In [48]:
data.head(1)

          runs
match_no
1           10

In [49]:
data['runs'][[1,3,5]] = [12,13,14]

In [51]:
data

          runs
match_no
1           12
2           23
3           13
4           12
5           14
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]